# Завдання 1
# Створіть клас Editor, який містить методи view_document та edit_document.
# Нехай метод edit_document виводить на екран інформацію про те,
# що редагування документів недоступне для безкоштовної версії.
# Створіть підклас ProEditor, у якому цей метод буде перевизначено.
# Введіть ліцензійний ключ із клавіатури і, якщо він коректний, створіть екземпляр класу ProEditor, інакше Editor.
# Викликайте методи перегляду та редагування документів.


class Editor:

    def view_document():
        pass

    def edit_document():
        print("Редагування документів недоступне для безкоштовної версії")


class Proeditor:

    def edit_document():
        print("Редагування документів доступне")


proper_key = "asd"

key = input("Введіть ліцензійний ключ: ")

if key == proper_key:
    current_editor = Proeditor
else:
    current_editor = Editor

current_editor.edit_document()


# Завдання 2
# Опишіть класи графічного об'єкта, прямокутника та об'єкта, який може обробляти натискання миші.
# Опишіть клас кнопки. Створіть об'єкт кнопки та звичайного прямокутника. Викличте метод натискання на кнопку.
